//! ცვლადების შექმნა შესაძლებელია სამი საშუალებით: var, let და const

// 1. let
let y = 20;
console.log(y); // 20

// 2. const
const z = 30;
console.log(z); // 30

// 3. var
var x = 10;
console.log(x); // 10

// განსხვავება let-სა და const-ს შორის არის ის, რომ let-ის მნიშვნელობა შეიძლება შეცვალოს, ხოლო const-ის მნიშვნელობა შეცვალდეს არ შეიძლება.

// --------------------------------------------------- //

//! ცლვადების შექმნა შესაძლებელია რამდენიმე საშუალებით:

// 1. ერთი ცვლადის შექმნა

let a = 10;
console.log(a); // 10

// 2. რამდენიმე ცვლადის შექმნა

let b = 20,
  c = 30,
  d = 40;
console.log(b, c, d); // 20 30 40

// 3. ცვლადების შექმნა ერთ ხაზში და შემდეგ მნიშვნელობის მინიჭება.

let f, g, h;
f = 50;
g = 60;
h = 70;

console.log(f, g, h); // 50 60 70

// --------------------------------------------------- //

// 4. დესტრუქტორიზაცია (რომელსაც გვიან შევეხებით და ხშირად დაგვჭირდება React-ზე)

let [i, j, k] = [80, 90, 100];

console.log(i, j, k); // 80 90 100

// --------------------------------------------------- //

//! გაფრთხილება.

// არ შეიძლება ცვლადის გამოძახება იქამდე სანამ მას შევქმნით.

console.log(l); // ReferenceError: l is not defined

let l = 110;

//! ასევე თუ ცვლადს შევქმნით და მას არ მივანიჭებთ მნიშვნელობას ის დაგვიბრუნებს undefined-ს.

let m;
console.log(m); // undefined
