//! არითმეტიკული ოპერატორები.

// გვაქვს 2 ცვლადი რომელსაც ვანიჭებთ 10-ს და 5-ს.

let x = 10;
let y = 5;

// გამოვიყენოთ ამ ორი ცვლადისთვის არითმეტიკული ოპერატორები.

console.log(x + y); //  მიმატება: 15
console.log(x - y); //  გამოკლება: 5
console.log(x * y); //  გამრავლება: 50
console.log(x / y); //  გაყოფა: 2
console.log(x % y); //  ნაშთი: 0
console.log(++x); //    ინკრემენტი: 11 (გაზრდა 1-ით)
console.log(--y); //    დეკრემენტი: 4  (შემცირება 1-ით)

//! არითმეტიკული ოპერატორები შეიძლება გამოიყენოთ სტრინგებისთვისც.

let a = 'Hello';

let b = 'World';

console.log(a + ' ' + b); // შედეგი: Hello World

// არითმეტიკული ოპერატორები შეიძლება გამოიყენოთ ცვლადების შორისაც.

let c = 10;
let d = 5;

c += d; // ანუ c = c + d;
console.log(c); // 15

c -= d; // ანუ c = c - d;
console.log(c); // 10

//! Assignment Operators:

// არითმეტიკული ოპერატორების გამოყენების შემდეგ შეგვიძლია გამოვიყენოთ ასახვად შემდეგი მეთოდები:

let e = 10;

e += 5; // ანუ e = e + 5;
console.log(e); // 15

e -= 5; // ანუ e = e - 5;
console.log(e); // 10

e *= 5; // ანუ e = e * 5;
console.log(e); // 50

e /= 5; // ანუ e = e / 5;
console.log(e); // 10

e %= 5; // ანუ e = e % 5;
console.log(e); // 0

// --------------------------------------------------- //

let f = 10;

f++; // ანუ f = f + 1;

console.log(f); // 11

f--; // ანუ f = f - 1;

console.log(f); // 10
