//! ლოგიკური ოპერატორები

// 1. ლოგიკური ინვერსია (წაწინააღმდეგო) - !

let a = true;

console.log(!a); // false ანუ არა ჭეშმარიტი (! ნიშნაი არის უარყოფა)

let b = false;

console.log(!b); // true ანუ ჭეშმარიტი

// 2. ლოგიკური "და" (კონკატენაცია) - &&

let c = true;
let d = false;

console.log(c && d); // false ანუ ორივე ჭეშმარიტი უნდა იყოს რომ მიიღოს ჭეშმარიტი

// 3. ლოგიკური "ან" (გაერთიანება) - ||

let e = true;
let f = false;

console.log(e || f); // true ანუ ჭეშმარიტი ერთი ან ორი ჭეშმარიტი უნდა იყოს რომ მივიღოთ ჭეშმარიტი

// 4. შედარება - == (არ ადარეგბს ტიპებს)

let g = 10;
let h = 10;

console.log(g == h); // true ანუ მათი მნიშვნელობები ერთნაირია

// 5. ტოლერანტული შედარება - === (ადარეგბს ტიპებს)

let i = 10;
let j = '10';

console.log(i === j); // false ანუ მათი მნიშვნელობები ერთნაირი არ არის

// 6. შედარება - != (არ უდრის)

let k = 10;
let l = 20;

console.log(k != l); // true ანუ მათი მნიშვნელობები სხვადასხვაა

// 7. ტოლერანტული შედარება - !== (არ უდრის და არ ადარეგბს ტიპებს)

let m = 10;
let n = '10';

console.log(m !== n); // true ანუ მათი მნიშვნელობები სხვადასხვაა და ტიპებიც სხვადასხვაა

// 8. შედარება - > (მეტია)

let o = 10;
let p = 20;

console.log(o > p); // false

// 9. შედარება - < (ნაკლებია)

let q = 10;
let r = 20;

console.log(q < r); // true

// 10. შედარება - >= (მეტია ან ტოლია)

let s = 10;
let t = 20;

console.log(s >= t); // false

// 11. შედარება - <= (ნაკლებია ან ტოლია)

let u = 10;
let v = 20;

console.log(u <= v); // true
